{
    "personal": {
        "tag": "$whoami:: jamesqthompson",
        "title": "Design Technologist",
        "longStatement": "Framer --- I have a passion for solving problems large and small. When I can leverage design and technology to solve problems I thrive. Using the design process, I can understand the problem space and the user and generate potential solutions. The technology aspect allows me to communicate those solutions in coded prototypes that can be shared with stakeholders and users for rapid feedback and iterations.\n\nI believe that any successful design begins by understanding the user and their context. In addition to understanding the user, the design process needs to be inclusive (design, engineering, product) throughout the entire process. This ensures that Design doesn’t get called in before launch to “make it pretty.”\n\nMy workplace experiences and the foundation I acquired while earning my degrees in Architecture and Graphic Design from the College of Design at North Carolina State University, has enabled me to be a more versatile designer and dedicated team member. I am committed to learning and expanding my skill set. I used the pandemic quarantine as an opportunity to obtain a certification in Data Analytics and Big Data. This certification has broadened my perspective and allows me to approach problems with a different lens.\n\nI prefer engaging with users and looking broadly across the organization to identify opportunities to add value to both the organization and the user. I seek to understand the users’ context and needs, and the needs of the business as they are the key to any successful design.\n\nLet’s see how we can work together to solve your problem!",
        "shortStatement": "I have a passion for solving problems large and small. When I can leverage design and technology to solve problems I thrive. Using the design process, I can understand the problem space and the user and generate potential solutions. The technology aspect allows me to communicate those solutions in coded prototypes that can be shared with stakeholders and users for rapid feedback and iterations. ",
        "contact": {
            "email": "thompsonjamesquillan@gmail.com",
            "location": "Austin, TX"
        }
    },
    "patents": {
        "Cradle for portable server monitor": {
            "displayName": "Cradle for portable server momitor",
            "url": "https://patents.google.com/patent/USD656940S1/en"
        }
    }
}