{
    "personal": {
        "tag": "$whoami:: jamesqthompson",
        "title": "Design Technologist",
        "longStatement": "I graduated from the College of Design  at North Carolina State University with degrees in architecture and graphic design. This unique combination is the foundation for my design career and catalyst for teaching myself how to code.\n\nI have a passion for solving problems large and small. When I am able to leverage design and technology to solve problems I thrive. Using the design process, I am able to understand the problem space and the user and generate potential solutions. The technology aspect allows me to communicate those solutions in coded prototypes that can be shared with stakeholders and users.\n\nI enjoy looking broadly across the organization and identifying opportunities to connect dots that add value to the organization. This broad approach allows me to learn new skills while expanding my current skillset. I seek to understand both the users’ needs and business needs as they are the key to any successful design.\n\nLet’s see how we can work together to solve your problem!",
        "shortStatement": "I graduated from the College of Design  at North Carolina State University with degrees in architecture and graphic design. This unique combination is the foundation for my design career and catalyst for teaching myself how to code.",
        "contact": {
            "email": "thompsonjamesquillan@gmail.com",
            "location": "Austin, TX"
        }
    },
    "patents": {
        "Cradle for portable server monitor": {
            "displayName": "Cradle for portable server momitor",
            "url": "https://patents.google.com/patent/USD656940S1/en"
        }
    },
    "process": {
        "title": "My Process",
        "text": "(Fahad, this a quick write up of the process. I want to add visuals here to support)\n\nWhile projects may vary in size the process remains the same. Each project begins with research to understand the 'who' and the 'why'. Who are we building for and why? With an understanding of purpose and audience conversations can always be brought back to the purpose and we can certain we deliver the right features. The 'what' can now be determined. The 'what' speaks to the functional aspects of the project, what needs to be built? One a small project, the 'what' can typically be determined by myself. On larger projects with multiple moving parts more stakeholders need to come together to contribute to the what. This is usually in the form of a design thinking exercise that I will lead. With an understanding of the 'what' visual design and development can begin the explore the 'how'. Working closely with visual design I begin to develop prototypes that represent our 'who', 'what' and 'why'. The prototypes can be validated with users and refined before giving the green light for production code development.\n\nBelow are a list of projects that demonstrate varied degrees of this process."
    }
}