{
    "1": {
        "name": "Photography Utility",
        "sections": [{
            "header": "Problem",
            "text": "My photographer friend was doing a product photoshoot. The photos were going to be used on a website but he had no idea how they would look. As he was shooting tethered to the computer the idea came to mind to take the photos as they come in and drop them into a web template, allowing him to see how the photos would look online in real-time.",
            "images": []
        },
        {
            "header": "Solution",
            "text": "I didn't know much about working with Node and file systems so I researched how to watch a file folder for updates. With the knowledge in hand I set out to build a simply utility that would watch a folder and copy any added files to a new directory. This new directory was the “web” directory. The website was hosted from this directory. In addition to the images was a web template setup to read in the images. The template had both list and details pages.\n\nOnce complete, I reached out to my friend to have him test everything out. I took his feedback to fine tune the utility documentation as well as the web template. He integrated the utility into his workflow and was able to fine tune photographs based on what he saw on the web demo",
            "images": [{
                "caption": "image caption",
                "url": "/images/photography-utility/hero.png"
            }]
        }]
    },
    "2": {
        "name": "Data Pipeline",
        "sections": [{
            "header": "Problem",
            "text": "section text here",
            "images": []
        },
        {
            "header": "Solution",
            "text": "section text here",
            "images": []
        }]
    },
    "3": {
        "name": "Auto AI Utility",
        "sections": [{
            "header": "Problem",
            "text": "section text here",
            "images": []
        },
        {
            "header": "Solution",
            "text": "section text here",
            "images": []
        }]
    },
    "4": {
        "name": "Cloud Brokerage",
        "sections": [{
            "header": "Problem",
            "text": "This product allowed a organization to track and understand cloud resources usage. As design lead I started the effort with a design thinking workshop. The workshop allowed all stakeholders to contribute to the process.We were able to align on expectations and user personas. I lead a team of 4 designers to bring the product to life. Although we had a limited pool of users available for testing, I was able to conduct test with people familiar with the space. Their feedback was used to enhance the user experience. I wanted to ensure we had a user experience that allowed a user to promptly see the information they needed to see without looking deep for it. Due to the nature of cloud resources it is easy to generate a bill that is larger than expected and not understand how it happened. Once implemented customers were able to save tens and hundreds of thousands of dollars based on their size.",
            "images": []
        },
        {
            "header": "Process",
            "text": "section text here",
            "images": [{
                "caption": "image caption",
                "url": "/images/cloud-brokerage/process_01.png"
            },
            {
                "caption": "image caption",
                "url": "/images/cloud-brokerage/process_02.png"
            },
            {
                "caption": "image caption",
                "url": "/images/cloud-brokerage/process_03.png"
            }]
        },
        {
            "header": "Solution",
            "text": "section text here",
            "images": [{
                "caption": "image caption",
                "url": "/images/cloud-brokerage/product_01.png"
            },
            {
                "caption": "image caption",
                "url": "/images/cloud-brokerage/product_02.png"
            },
            {
                "caption": "image caption",
                "url": "/images/cloud-brokerage/product_03.png"
            }]
        }]
    },
    "5": {
        "name": "SVG Animation",
        "sections": [{
            "header": "Problem",
            "text": "Merging multiple pattern sites into one, there was a desire to highlight the number of patterns being used across the organization. I was charged with implementing the animated SVG. Not knowing much about animated SVGs I collaborated with another team member who had a key piece of knowledge. Once I had that key piece of knowledge I was able to implement the animated SVG. Once implemented I began to figure out ways that would optimize the experience. I worked with the designer to understand how the exports were working and how we could exploit that to get our desired results. The animation has now been optimized",
            "images": []
        },
        {
            "header": "Solution",
            "text": "section text here",
            "images": [{
                "caption": "image caption",
                "url": "/images/animated-svg/01.png"
            },
            {
                "caption": "image caption",
                "url": "/images/animated-svg/02.png"
            }]
        }]
    },
    "6": {
        "name": "User Profile Image",
        "sections": [{
            "header": "Problem",
            "text": "section text here",
            "images": []
        },
        {
            "header": "Solution",
            "text": "section text here",
            "images": []
        }]
    },
    "7": {
        "name": "Watson Assistant",
        "sections": [{
            "header": "Problem",
            "text": "section text here",
            "images": []
        },
        {
            "header": "Solution",
            "text": "section text here",
            "images": []
        }]
    }
}