{
    "1": {
        "name": "Cloud Brokerage Platform",
        "icon": "/icons/cloud.png",
        "iconAlt": "cloud icon",
        "headerImage": "",
        "sections": [
        {
            "header": "Role, Tools",
            "content": [{
                "text": "Role: Design Lead, Project Manager\n Tools: Sketch"
            }]
        },
        {
            "header": "Opportunity",
            "content": [{
                "text": "As businesses transition to cloud-based infrastructure, untracked resources can lead to unexpected budget overruns. There was an opportunity to use data analytics to help businesses identify rouge resources before they impacted the budget."
            }]
        },
        {
            "header": "Solution",
            "content": [{
                "text": "I led a team of designers and developers to create an application that allowed DevOps and executive stakeholders to get insights into their cloud environments and to make adjustments as needed, ensuring budgets stayed intact. I kicked the project off with a Design Thinking workshop in which I invited all stakeholders.",
                "images": [
                {
                    "caption": "caption here",
                    "url": "/images/cloud-brokerage/workshop_01.png"
                },
                {
                    "caption": "caption here",
                    "url": "/images/cloud-brokerage/process_01.png"
                },
                {
                    "caption": "caption here",
                    "url": "/images/cloud-brokerage/process_02.png"
                },
                {
                    "caption": "caption here",
                    "url": "/images/cloud-brokerage/sketch_01.png"
                },
                {
                    "caption": "caption here",
                    "url": "/images/cloud-brokerage/product_01.png"
                }]
            }]
        },
        {
            "header": "Challenges",
            "content": [{
                "text": "Ensuring the executive team stayed the course with the design process. I was able to overcome this with constant communication and including them in the process."
            }]
        },
        {
            "header": "Outcome",
            "content": [{
                "text": "The UI delivered allowed businesses to quickly see what was going on in their cloud environments. This allowed them to easily see what resources would possibly lead to budget overruns."
            }]
        },
        {
            "header": "Takeaway",
            "content": [{
                "text": "Having all stakeholders in one room to contribute to the Design Thinking workshop I facilitated to kick the project off was vital. This allowed everyone to have a voice and feel invested in the process."
            }]
        }]
    },
    "2": {
        "name": "Automated Predictive Analytics",
        "icon": "/icons/predictive-analytics.png",
        "iconAlt": "predictive analytics icon",
        "headerImage": "",
        "sections": [
        {
            "header": "",
            "content": [{
                "text": "Tools: Python, React, Node.js, MySQL, Bulma, AWS, Google Sheets, Framer Motion, Figma\nRole: Frontend Development, Backend Development, Data Analyst"
            }]
        },
        {
            "header": "Opportunity",
            "content": [{
                "text":"With an interest in sports, I wanted to explore the correlation between in-game statistics and outcomes related to betting lines. If I were able to train a model that delivered an accuracy rate greater than 50%, there would be a possibility of “beating the bookie”."
            }]
        },{
            "header": "Solution",
            "content": [{
                "text":"I designed and developed an automated system that collected and analyzed data, and trained models based on the collected data. Before the automated system, I began capturing data by hand. This quickly became untenable as there were too many data points to capture promptly. I began to write a script that would capture the needed data in a fraction of the time. I soon realized that the script could be scaled out to multiple sports. With the data now being captured, I then set out to analyze the data and train models to make pre-game and in-game predictions. To avoid the manual process of starting the scripts to collect, analyze, and train, I wrote scripts to automate the entire process. Each morning the server boots and collects data. Once the games begin, the application will make pre-game and in-game predictions. When all games have ended, new models are trained based on the newly collected data. To avoid viewing predictions in a spreadsheet, I developed a UI that would allow a user to quickly see the predictions and track the results.",
                "images": []
            }]
        },
        {
            "header": "Challenges",
            "content": [{
                "text": "I had no idea of the scope when I took this on. I went from manually inputting data into a spreadsheet to researching how to deploy a Flask server to AWS."
            }]
        },
        {
            "header": "Outcome",
            "content": [{
                "text": "The trained models are producing results greater than 50% as desired. "                
            }]
        }]
    },
    "3": {
        "name": "Photography Website Generator",
        "icon": "/icons/photography.png",
        "iconAlt": "photography icon",
        "headerImage": "",
        "sections": [
        {
            "header": "",
            "content": [{
                "text": "Tools: NodeJS, ReactJS, Bash Scripting\nRole: UX Design, Front and Backend Development"}]
        },
        {
            "header": "Opportunity",
            "content": [{
                "text": "Speaking with a photographer, he told me he was working on a project that required him to shoot products for a website. I saw an opportunity to help him speed up his workflow. I wanted him to be able to photograph the products and immediately see them in a web layout."
            }]
        },
        {
            "header": "Solution",
            "content": [{
                "text": "I designed and developed a generic product website skin that allowed for navigation to multiple pages. In addition to the website skin, I developed an OS utility that took advantage of the photographer shooting tethered. As he photographed products, the images would automatically resize and display in the website's skin. He could click around to see how the photos looked on different screens and sizes.",
                "images": [
                    {
                        "caption": "Sketch of the product list page.",
                        "url": "/images/photography-utility/sketch_01.png"
                    },
                    {
                        "caption": "Sketch of the product page.",
                        "url": "/images/photography-utility/sketch_02.png"
                    }
                ],
                "videos": [{
                    "caption": "Simulation of photograph entering the computer and responsive website updating automatically.",
                    "url": "https://thompsonjamesquillan-portfolio.s3.us-east-2.amazonaws.com/workflow.mp4"
                }]
            }]
        },
        {
            "header": "Challenges",
            "content": [{
                "text": "Working with filesystems programmatically was a challenge for sure."}]
        },
        {
            "header": "Outcome",
            "content": [{
                "text": "The photographer made adjustments in real-time based on how the images looked on the web. An added benefit was he showed the client the photos on the web, impressing the client and leading to more work."
            }]
        },
        {
            "header": "Takeaways",
            "content": [{
                "text": "Once deployed I noticed that seemingly duplicate images would be presented in the template. It would be nice to allow a photographer to tag images and only those images tagged would show up giving a better idea of how the website as a whole would look."}]
        }]
    },
    "4": {
        "name": "IBM Auto AI Utility",
        "icon": "/icons/automation.png",
        "iconAlt": "automation icon",
        "headerImage": "",
        "sections": [
        {
            "header": "",
            "content": [{
                "text": "Tools: Python, ReactJS, Carbon \nRole: UX Designer, Front and Backend Developer"
            }]
        },{
            "header": "Opportunity",
            "content": [{
                "text": "There were calls in the company to include AI in our products. I thought if we could include AI in our prototypes, we could influence executives to assign resources to expand the AI into products. None of the developers on the team were versed in AI/ML and the learning curve was steep."
            }]
        },{
            "header": "Solution",
            "content": [{
                "text": "Possessing a certification in AI/ML, I developed a utility that allowed a developer without knowledge of model training to add a predictive model to a prototype. Working with a product owner, the developer could determine which features were needed to make predictions. They would simply upload the structured data to the tool and receive a file that was used as an API endpoint that provided predictions in their prototype. The predictive data would be a better representation than the dummy data.",
                "images": [{
                    "caption": "UI of model creation script.",
                    "url": "/images/ai-utility/01.png"
                },
                {
                    "caption": "UI of the model being used. 'Class' column is the prediction column.",
                    "url": "/images/ai-utility/02.png"
                }]
            }]
        },
        {
            "header": "Outcome",
            "content": [{
                "text":"Possessing a certification in AI/ML, I developed a utility that allowed a developer without knowledge of model training to add a predictive model to a prototype. Working with a product owner, the developer could determine which features were needed to make predictions. They would simply upload the structured data to the tool and receive a file that was used as an API endpoint that provided predictions in their prototype. The predictive data would be a better representation than the dummy data."                
            }]
        },
        {
            "header": "Takeaways",
            "content": [{
                "text": "Other skills I possess that I don’t leverage in my day-to-day work can still be used to help people at work make their lives easier. "}]
        }]
    },
    "5": {
        "name": "IBM SVG Animation",
        "icon": "/icons/svg.png",
        "iconAlt": "svg icon",
        "headerImage": "",
        "sections": [
        {
            "header": "Tools & Roles",
            "content": [{
                "text": "Tools: ReactJS, Lottie\nRole: Frontend Developer"
            }]
        },{
            "header": "Opportunity",
            "content": [{
                "text": "IBM has numerous pattern libraries across the design organization. There was an initiative to place all the libraries under one umbrella giving a user access to all of them from one website. In addition to one website, there was a desire to show a visualization of all of the patterns and their usage across the organization. Not knowing much about animated SVGs I took it upon myself to lead the initiative to get this site completed in the short timeline."
            }]            
        },
        {
            "header": "Solution",
            "content": [{
                "text": "I was able to develop a dynamic animated SVG that showed a breakdown of patterns used while giving additional information on hover. ",
                "videos": [{
                    "caption": "Animated SVG running on the internal website.",
                    "url": "https://thompsonjamesquillan-portfolio.s3.us-east-2.amazonaws.com/svg.mp4"
                }]
            }]
        },
        {
            "header": "Challenges",
            "content": [{
                "text": "While facing a short timeline with changing requirements I was able to overcome these challenges by having frank conversations and being honest with what could be delivered in the given timelines. I was able to deliver an MVP version and add enhancements weekly until the final update was made."
            }]            
        },
        {
            "header": "Outcome",
            "content": [{
                "text": "Developers and designers can quickly see how their patterns are being used across the organization. I structured the SVG to read from a data file to ensure that the animation stays in sync with the executive summary file. "
            }]            
        },{
            "header": "Takeaways",
            "content": [{
                "text": "Clear and honest communication can assist in getting the time needed to complete tasks. "}]
        }]
    },
    "6": {
        "name": "Watson Assistant",
        "icon": "/icons/chatbot.png",
        "iconAlt": "chatbot icon",
        "sections": [{
            "header": "Tools & Roles",
            "content": [{
                "text":"Tools: VueJS, \nRole: Frontend Development"
            }]
        },{
            "header": "Problem",
            "content": [{
                "text": "At the time, Watson Assistant 'out of the box' had no user interface. A customer would have to deploy resources to apply a user interface."
            }]
        },
        {
            "header": "Solution",
            "content": [{
                "text": "A generic user interface was applied to Watson Assistant, allowing a customer to focus on training the models and not the user interface. I developed a prototype to demonstrate the new chat window interface.",
                "videos": [{
                    "caption": "Simulation of a user interacting with the coded prototype of Watson Assistant.",
                    "url": "https://thompsonjamesquillan-portfolio.s3.us-east-2.amazonaws.com/widget.mp4"
                }]
            }]
        }]
    }
}